/*
** Bloomberg Application Programming Interface
**
** bbapi.h - General API Header  
*/

#ifndef __BBAPI_H
#define __BBAPI_H

#ifndef lint
static char RCSid_bbapi_h[] = "$Id: $ $CCId: /bbcm/api_backend/bbcomm_user/bbapit/bbapi.h /main/bb/91 2007/09/07 16:14:39 rsriniv $";
#endif

#ifndef __BBUNIX_H
#include <bbunix.h>
#endif

#ifndef MAIN
#define Extern extern
#else
#define Extern
#endif



enum apiErrorCode {
    INVALID_ARG = -9,
    TCP_IP_CONNECT_ERR = -8,
    DATA_RECV_ERR = -7,
    DATA_SEND_ERR = -6,
    SOCKET_SELECT_ERR =-5,
    APP_ID_INFO_NOT_FOUND = -4,
    SEND_CLIENT_VERSION_INFO_ERR = -3,
    CLIENT_LIBRARY_TOO_LOW_VERSION = -2,
    REGISTRATION_TIMEOUT =-1,
    NO_ERRORS,
    DUPLICATE_REGISTRATION,
    XML_PARSE_ERROR,
    XML_INVALID_ERROR,
    CHANGE_APP_CERT_INFO,
    APP_INFO_EXISTS,
    APP_UNREGISTERED,
    APP_MISSING_EXE,
    APP_INFO_NOT_ALLOWED,
    APP_ROOTKEY_NO_MATCH,
    APP_REG_COMPONENTS_EXIST,
    OTHER
};

/* Service codes (the routing logic of Comm Server depends mainly on these codes) */

#define BB_SVC_MIN                    -64
#define BB_SVC_MAX                     70
#define BB_SVC_NUM                     ((BB_SVC_MAX)-(BB_SVC_MIN)+1)
#define EXTENDED_HEADER			0x80000000
#define BB_SVC_INCOMPLETE               0     /* Partial message read. Call bb_rcvdata() again. */
#define BB_SVC_DEFAULTROUTE             0     /* Default entry in the Routing Table */

#define ErrCodeMAX_OVERLIMIT_VALUE           -3998

#define ErrOVERLIMITS_UPPER_BOUND            -3000
#define ErrOVERLIMITS_LOWER_BOUND            -4023

#define ErrOVERLIMITS_CORE              0x00000001
#define ErrOVERLIMITS_MARKET_DEPTH      0x00000002
#define ErrOVERLIMITS_GREEKS            0x00000004
#define ErrOVERLIMITS_UNUSED            0x00000008

#define FeatureCC					1
#define FeatureALL_PRICE_ETC		2
#define FeatureALL_PRICE_COND_CODE	(FeatureCC|FeatureALL_PRICE_ETC)

/*
** Compression types.  The client app bitwise or's together the types of compression
** that it is prepared to accept. The server returns the one it used.
*/
#define BBCompressNone				0
#define BBCompressCDE				1
#define BBCompressInter				2


/* Limits on number of items per multiple get history request */
#define BB_MAX_MHIST_SECS               8      /* maximum number of securities per mhistoryx request */
#define BB_MAX_MHIST_FLDS               5      /* maximum number of fields per mhistoryx request */
#define BB_MAX_SECURITY_TYPE           20      /* maximum length of the security type string (CUSIP, etc) */
#define BB_MAX_SEC_DESCRIPTION         32      /* maximum length of the security description string */
#define MAX_FUNDAMENTAL_FIELDS        1076
#define BB_MHIST_MAX_NUM_POINTS      7320      /* maximum number of data points per field */

/* number of places required to shift history flags */ 
#define BB_SHIFT_YIELD_PRICE            4 
#define BB_SHIFT_CLOSE_GPA              5
#define BB_SHIFT_NOAX                   6
#define BB_SHIFT_NOAX_FORM              8

/*Packet id for client report msg: */
#define CLIENT_REPORT_PACKET_ID 0x7fffffff 
#define CLIENT_REPORT_PACKET_ID_3PASID (CLIENT_REPORT_PACKET_ID - 1)

/*BB_SVC_CLIENTREPORT Types: */
#define REPORT_NOTIFICATION_ACK	1
#define REPORT_VERSION_INFO		2
#define REPORT_APP_SESS_ID_INFO	3 /* 3rd Party App Registration */

/*Products that we supply info for; */
#define VERSION_INFO_PRODUCT_BBCOMM		1
#define VERSION_INFO_PRODUCT_API		2
#define VERSION_INFO_PRODUCT_DDE		3
#define VERSION_INFO_PRODUCT_DATACTRL	4
#define VERSION_INFO_PRODUCT_OS			5
#define VERSION_INFO_PRODUCT_EXCEL		6

/*API Access Types: */
#define API_ACCESS_TYPE_DDE			1
#define API_ACCESS_TYPE_DATACTRL	2
#define API_ACCESS_TYPE_TOOLS		3
#define API_ACCESS_TYPE_3RD_PARTY	-1  /*catch all case*/

/* ticker lookup rcodes: (maxcount == Maximum # of names to return -> define as 1000) */
#define RCODE_TKLOOKUP_OK		0	/*numitems <= maxcount */
#define RCODE_TKLOOKUP_TOOMANY	1	/*numitems > maxcount */
#define RCODE_TKLOOKUP_NONE		2	/*numitems <=0 */

/*
** Any message returned by Bloomberg Comm Server to application
** begins with the structure bb_comm_header_t and continues based
** on the service code. All the different structures are listed below.
** Message handler subroutine should cast the pointer to bb_comm_header_t
** to the type that is appropriate for the service code handled.
*/

struct bb_comm_header_struct      /* The header of each logical DB message */
{
  int4     request_id;    /* Request Id as returned by any request function */
  int4     service_code;  /* Header/monid/tickdata...etc... (see codes above) */
  int4     return_code;   /* Status of the request (0 - good, !0 - bad) */
  int4     num_items;     /* Number of data items that follows (used by most formats) */
};

typedef struct bb_comm_header_struct bb_comm_header_t;

/*
** Msg handler subroutine takes a pointer to msg as an argument.
*/

#ifndef KandR
typedef    void (*bb_msg_handler_t)(struct bb_comm_header_struct *);
#else
typedef    void (*bb_msg_handler_t)();
#endif


/*
** Decoded security header information - part of the message returned in
** response to bb_getheader()
**
** NOTE : many of the entries in the header correspond to API 
**        fields.  If so, the comment in the structure below contains
**        the field id, in hex.  NOTE : The realtime field ID's corespond
**        to the realtime tick types. (So tick id's are the same integer id
**        as the corresponding API field, whose entries in the header is
**        marked below.)
*/

typedef struct
{
    int4     status;                    /* Return status: */
                                        /*  0 = OK */
                                        /* -1 = no longer used */
                                        /* -2 = no longer used */
                                        /* -3 = invalid security */
                                        /* -4 = header not found */
                                        /* -5 =	no trade data available */
                                        /* -6 =	no realtime available */

    double   price_open;                /* 0x2D  open price */
    double   price_high;                /* 0x09 high price */
    double   price_low;                 /* 0x0A low price */
    double   price_last;                /* 0x01 last price */
    double   price_settle;              /* 0x06 settlement price */
    double   price_bid;                 /* 0x02 bid price */
    double   price_ask;                 /* 0x03 ask price */
    double   yield_bid;                 /* 0x0B bid yield */
    double   yield_ask;                 /* 0x0C ask yield */
    double   limit_up;                  /* 0x0B up limit (futures) */
    double   limit_down;                /* 0x0C down limit (futures) */
    double   open_interest;             /* 0x08 open interest (futures) */
    double   yest_price_last;           /* 0x35 last price of previous session */
    double   scale;                     /* scale factor */
    int4     time_last;                 /* 0x3ff time of last price */
    int4     exchange_last;             /* exchange of last trade */
    int4     tick_direction;            /* up/down/zero tick */
    int4     size_bid;                  /* 0x3FB bid size */
    int4     size_ask;                  /* 0x3FA ask size */
    int4     condition_bid;             /* bid condition */
    int4     condition_ask;             /* ask condition */
    int4     condition_last;            /* last trade condition */
    int4     condition_market;          /* market condition */
    int4     monitorable;               /* monitorable  */
    int4     volume_total;              /* 0x07 total trade volume */
    int4     ticks_total;               /* total number of ticks */
    int4     time_start;                /* session start time */
    int4     time_end;                  /* session end time */
    int4     rt_pcs;                    /* real time pricing source (was currency) */
    int4     format;                    /* price display format */
    char     sec_key[32];               /* canonical form of security key */
    int4     date;                      /* as-of date ccyymmdd */

}   bb_decode_header_t;

typedef struct {
  int4 version;
  
  double yield_open;
  double yield_open_tdy;

  double yield_high;
  double yield_high_tdy;

  double yield_low;
  double yield_low_tdy;

  double yield_last;
  double yield_last_tdy; /*Version 2*/
  double yest_yield_last;

  double price_mid;          /* LSE gives mids & lasts! */
  double price_mid_tdy; 
  
  double price_bid_indicative;
  double yield_bid_indicative;
  double price_ask_indicative;
  double yield_ask_indicative; /*Version 3*/

  int4   LSE_flags;
  double price_AT_trade;          
  double price_AT_trade_tdy; /*Version 4*/

  int4 use_prev_close_prior_to_open; /*Version 5*/

  double last_trade;
  double last_trade_tdy; /*Version 6*/

  double vwap;           /* Version 7 */
  double vwap_tdy;       /* Version 7 */

  short weather_sflag; /* Version 8*/
  short weather_ssflag;/* Version 8*/
  int4  apply_intraday_cash_dividend_adjustment;   /* Version 9 */

  /* version 10 */
  int4   is_yield_quoted_security;
  double yest_price_last_pdfe;  /* yest last price based on PDFE settings */

  char bid_exchange_code ;
  char ask_exchange_code ;
  char last_exchange_code ;
  char dummy_pad_exchange_codes ; /** padding to maintain alignment */

} bb_decode_xheaderx_t;

typedef struct {
  int4 version;
  
  double yield_open;
  double yield_open_tdy;

  double yield_high;
  double yield_high_tdy;

  double yield_low;
  double yield_low_tdy;

  double yield_last;
  double yield_last_tdy; /*Version 2*/
  double yest_yield_last;

  double price_mid;          /* LSE gives mids & lasts! */
  double price_mid_tdy; 
  
  double price_bid_indicative;
  double yield_bid_indicative;
  double price_ask_indicative;
  double yield_ask_indicative; /*Version 3*/

  int4   LSE_flags;
  double price_AT_trade;          
  double price_AT_trade_tdy; /*Version 4*/

  int4 use_prev_close_prior_to_open; /*Version 5*/

  double last_trade;
  double last_trade_tdy; /*Version 6*/

  double vwap;           /* Version 7 */
  double vwap_tdy;       /* Version 7 */

  short weather_sflag; /* Version 8*/
  short weather_ssflag;/* Version 8*/
} bb_decode_xheaderx_v8_t;

typedef struct {

  int4 version;
  
  double yield_open;
  double yield_open_tdy;

  double yield_high;
  double yield_high_tdy;

  double yield_low;
  double yield_low_tdy;

  double yield_last;
  double yield_last_tdy; /*Version 2*/
  double yest_yield_last;

  double price_mid;          /* LSE gives mids & lasts! */
  double price_mid_tdy; 
  
  double price_bid_indicative;
  double yield_bid_indicative;
  double price_ask_indicative;
  double yield_ask_indicative; /*Version 3*/

  int4   LSE_flags;
  double price_AT_trade;          
  double price_AT_trade_tdy; /*Version 4*/

  int4 use_prev_close_prior_to_open; /*Version 5*/

  double last_trade;
  double last_trade_tdy; /*Version 6*/
  double vwap;           /* Version 7 */
  double vwap_tdy;       /* Version 7 */

} bb_decode_xheaderx_v7_t;

typedef struct {
  int4 version;
  
  double yield_open;
  double yield_open_tdy;

  double yield_high;
  double yield_high_tdy;

  double yield_low;
  double yield_low_tdy;

  double yield_last;
  double yield_last_tdy; /*Version 2*/
  double yest_yield_last;

  double price_mid;          /* LSE gives mids & lasts! */
  double price_mid_tdy; 
  
  double price_bid_indicative;
  double yield_bid_indicative;
  double price_ask_indicative;
  double yield_ask_indicative; /*Version 3*/

  int4   LSE_flags;
  double price_AT_trade;          
  double price_AT_trade_tdy; /*Version 4*/

  int4 use_prev_close_prior_to_open; /*Version 5*/

  double last_trade;
  double last_trade_tdy; /*Version 6*/
} bb_decode_xheaderx_v6_t;

typedef struct {
  int4 version;
  
  double yield_open;
  double yield_open_tdy;

  double yield_high;
  double yield_high_tdy;

  double yield_low;
  double yield_low_tdy;

  double yield_last;
  double yield_last_tdy; /*Version 2*/
  double yest_yield_last;

  double price_mid;          /* LSE gives mids & lasts! */
  double price_mid_tdy; 
  
  double price_bid_indicative;
  double yield_bid_indicative;
  double price_ask_indicative;
  double yield_ask_indicative; /*Version 3*/

  int4   LSE_flags;
  double price_AT_trade;          
  double price_AT_trade_tdy; /*Version 4*/

  int4 use_prev_close_prior_to_open; /*Version 5*/

} bb_decode_xheaderx_v5_t;


typedef struct {
  int4 version;
  
  double yield_open;
  double yield_open_tdy;

  double yield_high;
  double yield_high_tdy;

  double yield_low;
  double yield_low_tdy;

  double yield_last;
  double yield_last_tdy; /*Version 2*/
  double yest_yield_last;

  double price_mid;          /* LSE gives mids & lasts! */
  double price_mid_tdy; 
  
  double price_bid_indicative;
  double yield_bid_indicative;
  double price_ask_indicative;
  double yield_ask_indicative; /*Version 3*/

  int4   LSE_flags;
  double price_AT_trade;          
  double price_AT_trade_tdy; /*Version 4*/

} bb_decode_xheaderx_v4_t;

/* values for LSE_flags */
#define HEADER_IS_LSE  0x01
#define HEADER_HAS_MID 0x02
#define HEADER_HAS_AT 0x04

typedef struct {
  int4 version;
  
  double yield_open;
  double yield_open_tdy;

  double yield_high;
  double yield_high_tdy;

  double yield_low;
  double yield_low_tdy;

  double yield_last;
  double yield_last_tdy; /*Version 2*/
  double yest_yield_last;

  double price_mid;          /* LSE gives mids & lasts! */
  double price_mid_tdy; /*Version 3*/

} bb_decode_xheaderx_v3_t;

typedef struct {
  int4 version;
  
  double yield_open;
  double yield_open_tdy;

  double yield_high;
  double yield_high_tdy;

  double yield_low;
  double yield_low_tdy;

  double yield_last;
  double yield_last_tdy; /*Version 2*/

} bb_decode_xheaderx_v2_t;

#define DECODE_XHEADERX_VERSION 11

/*typedef bb_decode_xheaderx_v8_t bb_decode_xheaderx_t;*/

typedef struct
{
    int4     status;                    /* Return status: */
                                        /*  0 = OK */
                                        /* -1 = no longer used */
                                        /* -2 = no longer used */
                                        /* -3 = invalid security */
                                        /* -4 = header not found */
                                        /* -5 =	no trade data available */
                                        /* -6 =	no realtime available */

    double   price_open;                /* 0x2D  open price */
    double   price_open_tdy;            /* 0x2D  open price */

    double   price_high;                /* 0x09 high price */
    double   price_high_tdy;            /* 0x09 high price */

    double   price_low;                 /* 0x0A low price */
    double   price_low_tdy;             /* 0x0A low price */

    double   price_last;                /* 0x01 last price */
    double   price_last_tdy;            /* 0x01 last price */

    double   price_settle;              /* 0x06 settlement price */

    double   price_bid;                 /* 0x02 bid price */
    double   price_bid_tdy;             /* 0x02 bid price */

    double   price_ask;                 /* 0x03 ask price */
    double   price_ask_tdy;             /* 0x03 ask price */

    double   yield_bid;                 /* 0x0B bid yield */
    double   yield_bid_tdy;             /* 0x0B bid yield */

    double   yield_ask;                 /* 0x0C ask yield */
    double   yield_ask_tdy;             /* 0x0C ask yield */

    double   limit_up;                  /* 0x0B up limit (futures) */
    double   limit_down;                /* 0x0C down limit (futures) */
    double   open_interest;             /* 0x08 open interest (futures) */
    double   yest_price_last;           /* 0x35 last price of previous session */
    double   scale;                     /* scale factor */
    int4     time_last;                 /* 0x3ff time of last price */
    int4     exchange_last;             /* exchange of last trade */
    int4     tick_direction;            /* up/down/zero tick */

    int4     size_bid;                  /* 0x3FB bid size */
    int4     size_bid_tdy;              /* 0x3FB bid size */

    int4     size_ask;                  /* 0x3FA ask size */
    int4     size_ask_tdy;              /* 0x3FA ask size */

    int4     condition_bid;             /* bid condition */
    int4     condition_ask;             /* ask condition */
    int4     condition_last;            /* last trade condition */
    int4     condition_market;          /* market condition */

    int4     monitorable;               /* monitorable  */

    int4     volume_total;              /* 0x07 total trade volume */
    int4     volume_total_tdy;

    int4     ticks_total;               /* total number of ticks */
    int4     ticks_total_tdy;

    int4     time_start;                /* session start time */
    int4     time_end;                  /* session end time */
    int4     rt_pcs;                    /* real time pricing source (was currency) */
    int4     format;                    /* price display format */
    char     sec_key[32];               /* canonical form of security key */

    int4     date;                      /* as-of date ccyymmdd */
    int4     date_tdy;                  /* current date ccyymmdd */

    bb_decode_xheaderx_t *extra;

#if !(defined(BB_PLATFORM_DECAXP) || defined(LINUX_ALPHA))
	int4 dummy;  /*PAD PAD PAD PAD!*/    
#endif

    int4 extra_size; /*Size of eXtra data*/

    int4	 future_use[5];		

}   bb_decode_headerx_t;



